<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<h2>ajax</h2>
    <p>
        Asychronous JavaScript And XML의 약자로 <br>
        서버로부터 데이터를 가져와 전체 페이지를 새로 고치지 않고 일부만 로드할 수 있게 하는 기법 <br>
        기존 a태그로 요청 및 form 을 통해 요청했던 방식은 동기식 요청 <br>
        ->응답페이지가 돌아와야 볼수 있음(페이지 화면 깜빡거림) <br>
        비동기식 요청을 보내기 위해 AJAX 사용 <br><br>

        *동기식 / 비동기식 <br>
        동기식: 요청 처리 후 그에 해당하는 응답 페이지가 돌아아와야만 그 다음 작업 가능 <br>
        만약 서버에서 호출된 결과까지의 시간이 지연되면 계속 대기해야한다 <br>
        전체 페이지가 리로드 됨(새로고침) <br>

        * 비동기식 : 현재 페이지를 그대로 유지하면서 중간중간 추가적인 요청을 보내줄 수 있다. <br>
        요청을 해도 다른 페이지로 넘어가지 않음 (현재 페이지 유지) <br>
        요청을 보내놓고 응답이 돌아오기 전까지 다른 작업 가능 <br>
        ex)아이디 중복체크 기능 ,검색어 자동완성 기능, 인스타 댓글기능 등등... <br><br>

        *비동기식 단점 <br>
        - 현재 페이지에 지속적으로 리소스가 쌓이기 때문에 페이지가 느려질 수 있다 <br>
        - 페이지 내 복잡도가 기하급수적으로 증가 에러발생시 디버깅 어려움 <br>
        - 요청 후 돌아오는 응답데이터를 가지고 현재페이지에 새로운 요소를 만들어서 구현해야함
        ㄴ DOM요소 작성 구문을 잘 알아야 한다 <br>






    </p>
</body>
</html>